//Дана сторона квадрата. Найти его периметр.

Console.Write("Enter the side of the square: ");
int Side_Square = Convert.ToInt32(Console.ReadLine());
Console.Write($"P={Side_Square*4}");