// Вывести на экран два числа от пользователя одно под другим.

Console.Write("Введите первое число: ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int number2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Первое число: {number1}");
Console.WriteLine($"Второе число: {number2}");